In [15]:
import pandas as pd
import numpy as np

- 연습 문제 4.1.1
<pre>
(1) 임의로 두 개의 시리즈 객체를 만든다. 
모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
</pre>

In [33]:
import pandas as pd
import numpy as np
np.random.seed(2022)
dice1 = pd.Series(np.random.randint(1, 7, 3), index=['1회','2회','3회'])
dice2 = pd.Series(np.random.randint(1, 7, 3), index=['4회','5회','6회'])
print(dice1)
print(dice2)

1회    6
2회    5
3회    6
dtype: int32
4회    1
5회    2
6회    2
dtype: int32

In [34]:
dice1['1회'] + dice2['4회']

7

- 연습 문제 4.1.2
<pre>
다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.
</pre>

In [35]:
d, s, f = [],[],[]
for i in range(5):
    d.append(np.random.randint(1,11))
    f.append(np.random.normal(0,1))
s = ['서울','인천','대구','부산','대전']
pd.DataFrame({'지역':s, '번호':d, '평균':f}, index=['춘향', '몽룡', '향단', '방자', '사도'])

    지역  번호        평균
춘향  서울   1 -0.084866
몽룡  인천   4 -0.811910
향단  대구   9 -0.352692
방자  부산   2  0.777801
사도  대전   3 -0.069597

- 연습 문제 4.1.3
<pre>
다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.
data = {
  "국어": [80, 90, 70, 30],
  "영어": [90, 70, 60, 40],
  "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.
</pre>

In [36]:
import pandas as pd
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [37]:
df.수학

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [38]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [39]:
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [40]:
import warnings
warnings.filterwarnings('ignore')
df['영어']['방자'] = 80
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  56.67

In [41]:
df.head(1)  # 위에서 첫번째

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [43]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [44]:
df[:'향단']

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00

In [23]:
pd.DataFrame(df.loc['춘향'].astype(int))

    춘향
국어  80
영어  90
수학  90
평균  86

In [42]:
df.head(3).tail(1)      # 위에서 3개 중 마지막 것...

    국어  영어  수학    평균
향단  70  60  80  70.0

In [24]:
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [45]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

- 연습문제 4.3.1
<pre>
1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.
</pre>

In [25]:
data = np.random.randint(1,11,25).reshape(5,5)
df = pd.DataFrame(data, columns=['A','B','C','D','E'], index=['a','b','c','d','e'])
df

   A   B  C   D  E
a  6   2  8   6  6
b  5   9  3   4  2
c  1   5  6   1  8
d  6   6  9   3  5
e  1  10  5  10  9

In [26]:
print(df['B']['a'], df['B'].a, df.B.a, df.B[0])
print(df.loc['a']['B'], df.loc['a'].B, df.loc['a'][1], df.loc['a', 'B'])
print(df.iloc[0,1], df.iloc[0][1], df.iloc[0].B, df.iloc[0]['B'])

2 2 2 2
2 2 2 2
2 2 2 2